module.exports.config = {
    name: 'autosend2',
    version: '10.02',
    hasPermssion: 0,
    credits: 'DC-Nam', //mod check thời tiết by Kz Khánhh
    description: 'Tự động gửi tin nhắn theo giờ đã cài!',
    commandCategory: 'Hệ thống',
    usages: '[]',
    cooldowns: 3
};
const nam = [{
        timer: '1:15:00 AM',
        message: ['==== [ 𝗔𝗨𝗧𝗢 𝗥𝗘𝗦𝗧𝗔𝗥𝗧 ] ====\n━━━━━━━━━━━━━━━━━━\n→ 𝗔𝗿𝗮 𝗔𝗿𝗮 ✨ 𝗯𝗮̂𝘆 𝗴𝗶𝗼̛̀ 𝗹𝗮̀: {time} ⏰\n→ 𝗕𝗢𝗧 𝗦𝗲̃ 𝘁𝗶𝗲̂́𝗻 𝗵𝗮̀𝗻𝗵 𝗿𝗲𝘀𝗲𝘁 𝗹𝗮̣𝗶 𝗵𝗲̣̂ 𝘁𝗵𝗼̂́𝗻𝗴 💻 𝗻𝗵𝗮 𝗰𝗮́𝗰 𝗯𝗮̣𝗻 , 𝗰𝗵𝗼̛̀ 𝘁𝗶́']
        },
        {
     timer: '5:15:00 AM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝘁𝗿𝘂̛𝗮 𝘃𝘂𝗶 𝘃𝗲̉😋\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
        },
           {
     timer: '6:15:00 AM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝘁𝗿𝘂̛𝗮 𝘃𝘂𝗶 𝘃𝗲̉😋\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
        },
           {
     timer: '7:15:00 AM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝘁𝗿𝘂̛𝗮 𝘃𝘂𝗶 𝘃𝗲̉😋\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
        },
           {
     timer: '8:15:00 AM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝘁𝗿𝘂̛𝗮 𝘃𝘂𝗶 𝘃𝗲̉😋\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
        },   
        {
     timer: '9:15:00 AM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝘁𝗿𝘂̛𝗮 𝘃𝘂𝗶 𝘃𝗲̉😋\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
        },
           {
     timer: '10:15:00 AM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝘁𝗿𝘂̛𝗮 𝘃𝘂𝗶 𝘃𝗲̉😋\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
        },
           {
     timer: '11:15:00 AM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝘁𝗿𝘂̛𝗮 𝘃𝘂𝗶 𝘃𝗲̉😋\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
        },
           {
     timer: '12:15:00 AM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝘁𝗿𝘂̛𝗮 𝘃𝘂𝗶 𝘃𝗲̉😋\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
        },
               {
        timer: '1:15:00 PM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n🧸𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝗰𝗵𝗶𝗲̂̀𝘂 đ𝗮̂̀𝘆 𝗻𝗮̆𝗻𝗴 𝗹𝘂̛𝗼̛̣𝗻𝗴\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
    },
                 {
        timer: '2:15:00 PM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n🧸𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝗰𝗵𝗶𝗲̂̀𝘂 đ𝗮̂̀𝘆 𝗻𝗮̆𝗻𝗴 𝗹𝘂̛𝗼̛̣𝗻𝗴\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
    },
                 {
        timer: '3:15:00 PM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n🧸𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝗰𝗵𝗶𝗲̂̀𝘂 đ𝗮̂̀𝘆 𝗻𝗮̆𝗻𝗴 𝗹𝘂̛𝗼̛̣𝗻𝗴\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
    },
                 {
        timer: '4:15:00 PM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n🧸𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝗰𝗵𝗶𝗲̂̀𝘂 đ𝗮̂̀𝘆 𝗻𝗮̆𝗻𝗴 𝗹𝘂̛𝗼̛̣𝗻𝗴\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
    },
                 {
        timer: '5:15:00 PM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n🧸𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝗰𝗵𝗶𝗲̂̀𝘂 đ𝗮̂̀𝘆 𝗻𝗮̆𝗻𝗴 𝗹𝘂̛𝗼̛̣𝗻𝗴\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
    },
                 {
        timer: '6:15:00 PM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n🧸𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝗰𝗵𝗶𝗲̂̀𝘂 đ𝗮̂̀𝘆 𝗻𝗮̆𝗻𝗴 𝗹𝘂̛𝗼̛̣𝗻𝗴\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
    },
                 {
        timer: '7:15:00 PM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n🧸𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝗰𝗵𝗶𝗲̂̀𝘂 đ𝗮̂̀𝘆 𝗻𝗮̆𝗻𝗴 𝗹𝘂̛𝗼̛̣𝗻𝗴\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
    },
                 {
        timer: '8:15:00 PM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n🧸𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝗰𝗵𝗶𝗲̂̀𝘂 đ𝗮̂̀𝘆 𝗻𝗮̆𝗻𝗴 𝗹𝘂̛𝗼̛̣𝗻𝗴\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
    },
                 {
        timer: '9:15:00 PM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n🧸𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝗰𝗵𝗶𝗲̂̀𝘂 đ𝗮̂̀𝘆 𝗻𝗮̆𝗻𝗴 𝗹𝘂̛𝗼̛̣𝗻𝗴\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
    },
        {
        timer: '10:15:00 PM',
        message: ['==== 𝗔𝗨𝗧𝗢 𝗦𝗘𝗡𝗗 ====\n━━━━━━━━━━━━━━━━\n➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀: {time}\n🧸𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗯𝘂𝗼̂̉𝗶 𝗰𝗵𝗶𝗲̂̀𝘂 đ𝗮̂̀𝘆 𝗻𝗮̆𝗻𝗴 𝗹𝘂̛𝗼̛̣𝗻𝗴\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:「{thinh}」\n━━━━━━━━━━━━━━━━\n𝗕𝗼𝘁 đ𝗮̃ 𝗼𝗻𝗹𝗶𝗻𝗲 đ𝘂̛𝗼̛̣𝗰: {hours} 𝗴𝗶𝗼̛̀ {minutes} 𝗽𝗵𝘂́𝘁 {seconds} 𝗴𝗶𝗮̂𝘆\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
    }];
module.exports.onLoad = o => setInterval(async() => {
    const r = a => a[Math.floor(Math.random()*a.length)];
    if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())){
  const axios = require('axios');
const time = process.uptime();
		 var hours = Math.floor(time / (60 * 60));
		var minutes = Math.floor((time % (60 * 60)) / 60);
	var seconds = Math.floor(time % 60);
  var msg = r(á.message);
  const res = await axios.get(`https://api.popcat.xyz/weather?q=${encodeURI('Hồ Chí Minh')}`);
    var abc =`===「𝗧𝗕 𝗧𝗵𝗼̛̀𝗶 𝗧𝗶𝗲̂́𝘁」===\n━━━━━━━━━━━━━━\n→ 𝗰𝗮̣̂𝗽 𝗻𝗵𝗮̣̂𝘁 𝘁𝗵𝗼̛̀𝗶 𝘁𝗶𝗲̂́𝘁 𝘁𝗮̣𝗶 ${res.data[0].location.name}\n→ 𝗩𝗮̀𝗼 𝗹𝘂́𝗰: ${res.data[0].current.day} ${res.data[0].current.date}\n→ 𝗡𝗵𝗶𝗲̣̂𝘁 đ𝗼̣̂: ${res.data[0].current.temperature}°${res.data[0].location.degreetype}\n→ 𝗠𝗼̂ 𝘁𝗮̉: ${res.data[0].current.skytext}\n→ đ𝗼̣̂ 𝗮̂̉𝗺: ${res.data[0].current.humidity}\n→ 𝗛𝘂̛𝗼̛́𝗻𝗴 𝗴𝗶𝗼́: ${res.data[0].current.winddisplay}\n→ 𝗚𝗵𝗶 𝗻𝗵𝗮̣̂𝗻 𝘃𝗮̀𝗼 𝗹𝘂́𝗰: ${res.data[0].current.observationtime} 𝗧𝘂̛̀ 𝘁𝗿𝗮̣𝗺 𝘃𝘂̃ 𝘁𝗿𝘂̣ 𝗻𝗮𝘀𝗮 🚀`;
    msg = msg.replace(/{abc}/,abc);
msg = msg.replace(/{hours}/g, hours)
  msg = msg.replace(/{minutes}/g, minutes)
  msg = msg.replace(/{seconds}/g, seconds)
    msg = msg.replace(/{time}/g, require("moment-timezone").tz("Asia/Ho_Chi_Minh").format("HH:mm:ss (D/MM/YYYY) (dddd)")).replace(/{thinh}/g, (await axios.get(`https://4dd9ea6e-d5a6-4f8f-892c-ce90e4d539b9-00-11lae77drh9zo.janeway.replit.dev/thinh`)).data.url)
            msg = {
                body: msg, attachment: (await axios.get((await axios.get(`https://4dd9ea6e-d5a6-4f8f-892c-ce90e4d539b9-00-11lae77drh9zo.janeway.replit.dev/vdanime`)).data.url, {
                    responseType: 'stream'
                })).data
            };
   global.data.allThreadID.forEach(i => o.api.sendMessage(msg, i));
    };
}, 1000);

module.exports.run = async o => {
  try{
  const axios = global.nodemodule["axios"];
  const fs = global.nodemodule["fs-extra"];
  const request = global.nodemodule["request"];
  const { api, event, args } = o;
	const { threadID, messageID } = event;
  var bok = args.join(" ");
  if(!bok) return api.sendMessage("nhập tỉnh/tp cần xem thời tiết", threadID);
  const res = await axios.get(`https://api.popcat.xyz/weather?q=${encodeURI(bok)}`);
  const bokk = res.data[0].forecast;
  var text = `Thời tiết của: ${bok} vào các ngày`;
  for (let i = 0; i < 5; i++) {
    text += `\n${i+1}-> ${bokk[i].day} ${bokk[i].date}\n=>Nhiệt độ dự báo: từ ${bokk[i].low} đến ${bokk[i].high}\n=>Mô tả: ${bokk[i].skytextday}\n=>Tỷ lệ mưa: ${bokk[i].precip}\n`
  };
  api.sendMessage(text, threadID, messageID)
  }catch(err){api.sendMessage(`${err}`, threadID)}
             }